"""
1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
"""
print('Введите два числа')
a = int(input("Введите первое целое трехзначное число: "))
b = int(input("Введите второе целое трехзначное число: "))
c = a + b
print("Сумма чисел:", c)
d = a * b
print("Произведение чисел:", d)
