"""
6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""

x = chr(int(input('Введите номер буквы в алфавите от A(65) до Z(90) ')))
print(x)

